20220126105030-deploy.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-03 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>deploy</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">deploy</h1>
<div id="outline-container-org8790e68" class="outline-2">
<h2 id="org8790e68"><a href="#org8790e68">概要</a></h2>
<div class="outline-text-2" id="text-org8790e68">
<p>
デプロイは、開発したアプリケーションをサーバに展開して利用できるようにすること。現代的な開発においてはデプロイを頻繁にして次々とリリースしていくため、デプロイのコストが低いことは重視される。
</p>
</div>
</div>
<div id="outline-container-org92fce43" class="outline-2">
<h2 id="org92fce43"><a href="#org92fce43">Memo</a></h2>
<div class="outline-text-2" id="text-org92fce43">
</div>
<div id="outline-container-org5d52970" class="outline-3">
<h3 id="org5d52970"><a href="#org5d52970">実際のチーム開発に必要な周辺ツール</a></h3>
<div class="outline-text-3" id="text-org5d52970">
<p>
単にデプロイが実行できるだけではチーム開発では不便である。
</p>

<ul class="org-ul">
<li>検証環境用デプロイ
ブランチとマシン環境を指定できる。</li>
<li>本番環境用デプロイ
事故防止のため、デフォルトブランチだけをproductionマシンにデプロイできる。</li>
<li>デプロイのトリガー通知
誰がどのブランチを、どのマシン環境に向けてデプロイしたのか。誰かと同時に実行してないか。</li>
<li>デプロイの成功/失敗通知
デプロイが成功したか。失敗した場合はジョブへのリンクを表示する。</li>
</ul>
</div>
</div>
<div id="outline-container-org57bb920" class="outline-3">
<h3 id="org57bb920"><a href="#org57bb920">コンテナデプロイとGitデプロイの違い</a></h3>
<div class="outline-text-3" id="text-org57bb920">
<p>
EC2インスタンスやオンプレミスでサーバを動かす旧来の方法は、本質的にgit pullによって変更コードを取り込み、ビルドしてリリースする。git管理しているコードしか反映できず、言語環境や環境変数、秘密情報はサーバを操作する必要がある。そのため変更を追うのが難しく、それぞれの環境が異なるので再現性に欠ける。
</p>

<p>
コンテナデプロイでは、コードに加えて言語環境やライブラリも含めてコンテナに封入する。コンテナホストサービスによって秘密情報の登録もサポートされている。再現性が高く、宣言的に記述するためメンテナンスしやすい。
</p>
</div>
</div>
<div id="outline-container-org5dcc91f" class="outline-3">
<h3 id="org5dcc91f"><a href="#org5dcc91f">ブルーグリーン・デプロイ</a></h3>
<div class="outline-text-3" id="text-org5dcc91f">
<p>
古い環境はブルー、新しい環境はグリーン。古いデプロイと新しいデプロイが同時に混在する環境を構築した後、ロードバランサー等によってトラフィックを切り替え、ダウンタイムなしで環境を切り替えること。ユーザ側からみるとどちらかの状態しかなく、整合性が保たれている。
</p>
</div>
</div>
<div id="outline-container-orgfbb2573" class="outline-3">
<h3 id="orgfbb2573"><a href="#orgfbb2573">ローリングアップデート</a></h3>
<div class="outline-text-3" id="text-orgfbb2573">
<p>
稼働中のシステムを完全には停止させずに、徐々に新しいものに入れ替えていく方式。更新中は新旧のバージョンが混在するので整合性を維持しなければならない。
</p>
</div>
</div>
<div id="outline-container-org93153ae" class="outline-3">
<h3 id="org93153ae"><a href="#org93153ae">カナリアリリース</a></h3>
<div class="outline-text-3" id="text-org93153ae">
<p>
新機能を一部ユーザーのみが利用できるようにリリースして、新機能に問題がないことを確認しながら、段階的に全体に展開していくデプロイ手法のこと。
</p>
</div>
</div>
</div>
<div id="outline-container-org1b540d4" class="outline-2">
<h2 id="org1b540d4"><a href="#org1b540d4">Tasks</a></h2>
<div class="outline-text-2" id="text-org1b540d4">
</div>
<div id="outline-container-org3afbf81" class="outline-3">
<h3 id="org3afbf81"><a href="#org3afbf81"><span class="todo TODO">TODO</span> <a href="https://www.amazon.co.jp/Release-%E6%9C%AC%E7%95%AA%E7%94%A8%E3%82%BD%E3%83%95%E3%83%88%E3%82%A6%E3%82%A7%E3%82%A2%E8%A3%BD%E5%93%81%E3%81%AE%E8%A8%AD%E8%A8%88%E3%81%A8%E3%83%87%E3%83%97%E3%83%AD%E3%82%A4%E3%81%AE%E3%81%9F%E3%82%81%E3%81%AB-Michael-T-Nygard/dp/4274067491">Release It! 本番用ソフトウェア製品の設計とデプロイのために | Michael T. Nygard, でびあんぐる |本 | 通販 | Amazon</a></a></h3>
<div class="outline-text-3" id="text-org3afbf81">
<p>
本番用ソフトウェアの本。
</p>
</div>
</div>
</div>
<div id="outline-container-org44e2840" class="outline-2">
<h2 id="org44e2840"><a href="#org44e2840">Reference</a></h2>
<div class="outline-text-2" id="text-org44e2840">
</div>
<div id="outline-container-org5a63bfe" class="outline-3">
<h3 id="org5a63bfe"><a href="#org5a63bfe"><a href="https://www.amazon.co.jp/dp/B01N0SS6NF/ref=dp-kindle-redirect?_encoding=UTF8&amp;btkr=1">Amazon.co.jp: Deploying Rails with Docker, Kubernetes and ECS (English Edition) eBook : Acuña, Pablo: Foreign Language Books</a></a></h3>
<div class="outline-text-3" id="text-org5a63bfe">
<p>
<a href="20210805005543-docker.html#ID-1658782a-d331-464b-9fd7-1f8233b8b7f8">Docker</a>, <a href="20210922011437-kubernetes.html#ID-81b73757-21b3-438c-ab65-680b5ad88a1b">Kubernetes</a>, <a href="20211221000645-aws.html#ID-d17ea774-2739-44f3-89dc-97a86b2c7bf7">AWS</a> ECSで<a href="20210509095946-rails.html#ID-e04aa1a3-509c-45b2-ac64-53d69c961214">Rails</a>をデプロイする本。
</p>
</div>
</div>
</div>
<div id="outline-container-org4dc7354" class="outline-2">
<h2 id="org4dc7354"><a href="#org4dc7354">Archives</a></h2>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
